maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocManager.cpp
/*
 * PsocManager.cpp
 *
 *  Created on: 20 бреб 2013
 *      Author: maora
 */

#include "PsocManager.h"
#include "PsocMessageStruct.h"
#include <Peripherals/PeripheralRepository.h>
#include <version.h>
#include <logger.h>
#ifndef WIN32
#include <arm_itm.h>
#else
#define ITM_EVENT8(a,b)
#endif

#define M_NUMBER_OF_RETRIES 10
#define M_DEFAULT_ROUND_ROBIN_DELAY 4

//PsocManager PsocManager::s_instance;

//extern "C" int g_txInterruptState;
//extern "C" int g_rxInterruptState;

//int lastTickCount;

T_PsocHandler::T_PsocHandler()
{
    cableId = -1;
//    m_psocPrimaryFunction = E_PsocPrimaryFunction_Undefined;
    psocHandler.setPsocCommState(E_PsocCommState_Disabled);
    reset();
}

void T_PsocHandler::reset()
{
    temperaturePeripheral = NULL;
    pwmPeripheral = NULL;
    digitalOutPeripheral = NULL;
    digitalInPeripheral = NULL;
    analogInPeripheral = NULL;
    analogOutPeripheral = NULL;
    comFailures = 0;
    spiComFailures = 0;
    nextRequest = E_PsocRequest_ReadTemperaturePwmDi;
    lastOutputsStatus = false;
//    psocHandler.reset();
}

void T_PsocHandler::resetPsocOutputs()
{
    if (psocHandler.getPsocCommState() != E_PsocCommState_Enabled)
        return;

    // reset all outputs on the PSoC:
    psocHandler.resetOutputs();

    // wait until all outputs have been written:
    while (psocHandler.isPendingUpdate())
    {
        vTaskDelay(10);
    }
}

PsocManager::PsocManager()
{
    m_currentPsoc = 0;
    m_roundRobinDelay = M_DEFAULT_ROUND_ROBIN_DELAY;
    m_numOfActivePsocs = 0;
    m_globalSpiComFailues = 0;

    m_blockingCallCompleteSemaphore.create();
    m_blockingCallCompleteSemaphore.take(0);

    m_semaphoreUsed.create();
    m_semaphoreUsed.give();

    m_totalNumberOfPsocs = Psc_GetNumberOfSlaves();
    m_isInBootloader = false;
    m_isSpiResetPending = false;

    m_lastRequest = E_PsocCommands_EmptyCommand;
    m_pBoardState = NULL;
    m_boardMode = E_BoardMode_Normal;
}

PsocManager::~PsocManager()
{
}

E_PsocSpiError PsocManager::getPsocCableID(uint8_t psocIndex, uint8_t& cable1, uint8_t& cable2, uint8_t& cable3,
        uint8_t& errorBits)
{
    PsocHandler* psocHandler;
    E_PsocSpiError spiResult;
    psocHandler = getPsocHandlerByIndex(psocIndex);

    if (psocHandler == NULL || psocHandler->getPsocCommState() == E_PsocCommState_Error)
    {
        cable1 = 0;
        cable2 = 0;
        cable3 = 0;
        return E_PsocSpiError_NoSlaveResponse;
    }
//        psocHandler->setPsocCommState(E_PsocCommState_Enabled);

    takeBlockingSemaphore();
    spiResult = psocHandler->getCableID(&m_blockingCallCompleteSemaphore, cable1, cable2, cable3, errorBits);
    giveBlockingSemaphore();

    if (spiResult != E_PsocSpiError_Ok)
    {
        psocHandler->setPsocCommState(E_PsocCommState_Error);
        cable1 = 0;
        cable2 = 0;
        cable3 = 0;
        return spiResult;
    }

    // verify cable ID's
    if (cable1 == cable2 && cable1 == cable3)
    {
        psocHandler->setCableID(cable1);
        if (cable1 == 0)
            psocHandler->setPsocCommState(E_PsocCommState_Disabled);
        else
            psocHandler->setPsocCommState(E_PsocCommState_Enabled);
    }
    // not all cable IDs are equal. So we find the most useful:
    else
    {
        if (cable1 != 0)
            psocHandler->setCableID(cable1);
        else if (cable2 != 0)
            psocHandler->setCableID(cable2);
        else if (cable3 != 0)
            psocHandler->setCableID(cable3);
    }

    return spiResult;
}

E_PsocSpiError PsocManager::getPsocVersion(uint8_t psocIndex, T_PsocVersion& version)
{
    PsocHandler* psocHandler;
    E_PsocSpiError spiResult;
    psocHandler = getPsocHandlerByIndex(psocIndex);

    if (psocHandler == NULL || psocHandler->getPsocCommState() == E_PsocCommState_Error)
    {
        version.firmwareVersion.full = 0;
        version.protocolVersion.full = 0;
    }
    else
    {
        takeBlockingSemaphore();
        spiResult = psocHandler->getVersion(&m_blockingCallCompleteSemaphore, version);
        giveBlockingSemaphore();
    }

    return spiResult;
}

PsocTemperaturePeripheral* PsocManager::getTemperaturePeripheralByIndex(int index)
{
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getTemperaturePeripheral();
}

PsocTemperaturePeripheral* PsocManager::getTemperaturePeripheralByCableId(int cableId)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getTemperaturePeripheral();
}

PsocPwmOutputPeripheral* PsocManager::getPwmPeripheralByCableId(int cableId)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getPwmPeripheral();
}

PsocPwmOutputPeripheral* PsocManager::getPwmPeripheralByIndex(int index)
{
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getPwmPeripheral();
}

PsocAnalogOutputPeripheral* PsocManager::getAnalogOutPeripheralByCableId(int cableId)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getAnalogOutPeripheral();
}

PsocAnalogOutputPeripheral* PsocManager::getAnalogOutPeripheralByIndex(int index)
{
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getAnalogOutPeripheral();
}

PsocDigitalOutputPeripheral* PsocManager::getDigitalOutPeripheralByCableId(int cableId)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getDigitalOutPeripheral();
}

PsocDigitalOutputPeripheral* PsocManager::getDigitalOutPeripheralByIndex(int index)
{
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getDigitalOutPeripheral();
}

PsocDigitalInputPeripheral* PsocManager::getDigitalInPeripheralByIndex(int index)
{
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getDigitalInPeripheral();
}

PsocDigitalInputPeripheral* PsocManager::getDigitalInPeripheralByCableId(int cableId)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getDigitalInPeripheral();
}

