maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocManager.cpp
PsocAnalogInputsPeripheral* PsocManager::getAnalogInPeripheralByCableId(int cableId)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getAnalogInPeripheral();
}

PsocAnalogInputsPeripheral* PsocManager::getAnalogInPeripheralByIndex(int index)
{
    if (index == -1)
        return NULL;
    return m_psocHandlers[index].getAnalogInPeripheral();
}

void PsocManager::startShutdown()
{
    for (int i = 0; i < M_NUMBER_OF_PSOCS; ++i)
    {
        m_psocHandlers[i].setPsocIsInReady(false);
    }
}

// This method should never be called directly, since it's fucking up the psoc handler's semaphores.
// it should also always be called from within the PSoC Manager task.
void PsocManager::resetSpiCommunication()
{
#ifndef WIN32
    M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "Resetting SPI");
    // reset the SPI setup.
    PSOC_setupSpiWithDma();
    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        m_psocHandlers[i].resetCommunications();
        m_psocHandlers[i].setPsocCommState(E_PsocCommState_Enabled);
        m_psocHandlers[i].m_comFailures = 0;
        m_psocHandlers[i].m_spiComFailures = 0;
    }
    downloadConfigurationToPsocs();
#endif
}

void PsocManager::execute(int psocIndex)
{
    E_PsocSpiError psocError;

    // update the next request now. In case a blocking request is performed, it will override this request.
    if (m_psocHandlers[psocIndex].isRequestPending())
    {
        if (m_psocHandlers[psocIndex].isPendingUpdate())
        {
            m_psocHandlers[psocIndex].updatePendingOutputs();
        }
        else
        {
            switch (m_psocHandlers[psocIndex].m_nextRequest)
            {
            case E_PsocRequest_ReadTemperaturePwmDi:
//                if (psocIndex == 1)
//                {
//                    printf("read delay: %d\n", getTickCount()-lastTickCount);
//                    lastTickCount = getTickCount();
//                }
                m_psocHandlers[psocIndex].getTemperaturePwmDiSensors();
                m_psocHandlers[psocIndex].m_nextRequest = E_PsocRequest_ReadAnalogsFeedbacksErrors;
                break;
            case E_PsocRequest_ReadAnalogsFeedbacksErrors:
                m_psocHandlers[psocIndex].getAnalogsFeedbacksErrors();
                m_psocHandlers[psocIndex].m_nextRequest = E_PsocRequest_ReadTemperaturePwmDi;
                break;
            }
        }
    }

    // call the current psoc's execute
    psocError = m_psocHandlers[psocIndex].execute();
    if (psocError != E_PsocSpiError_Ok)
    {
//        M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x", psocIndex, psocError);
        ++m_psocHandlers[psocIndex].m_comFailures;
        if (psocError == E_PsocSpiError_NoSpiResponse)
        {
            ++m_psocHandlers[psocIndex].m_spiComFailures;
            ++m_globalSpiComFailues;
//            M_LOGGER_LOGF(M_LOGGER_LEVEL_FATAL, "DMA TX State %d RX State %d", g_txInterruptState, g_rxInterruptState);
        }
        if (m_psocHandlers[psocIndex].m_comFailures >= M_NUMBER_OF_RETRIES)
        {
            m_psocHandlers[psocIndex].setPsocCommState(E_PsocCommState_Error);
            if (m_psocHandlers[psocIndex].m_spiComFailures > 0)
            {
                //resetSpiCommunication();
                m_isSpiResetPending = true;
            }
        }
        if (m_globalSpiComFailues >= M_NUMBER_OF_RETRIES)
        {
//            resetSpiCommunication();
            m_isSpiResetPending = true;
        }
        // TODO: Move the board to error state.
    }
    else
    {
        m_psocHandlers[psocIndex].m_comFailures = 0;
        m_psocHandlers[psocIndex].m_spiComFailures = 0;
        m_globalSpiComFailues = 0;

        if (m_psocHandlers[psocIndex].isPsocIsInReady()
                && m_psocHandlers[psocIndex].getPsocPrimaryFunction() == E_PsocPrimaryFunction_Applicator)
        {
            if ((m_psocHandlers[psocIndex].getLastErrors() & E_PsocErrorBits_LiquidDetectorError))
                m_psocHandlers[psocIndex].getDigitalOutPeripheral()->getElementByIndex(3)->setValueValid(false);
            else
                m_psocHandlers[psocIndex].getDigitalOutPeripheral()->getElementByIndex(3)->setValueValid(true);

            //m_psocHandlers[psocIndex].digitalOutPeripheral->getElementByIndex(3)->setValueValid(((m_psocHandlers[psocIndex].getLastErrors() & E_PsocErrorBits_LiquidDetectorError) == 0));
        }

        // compare the current output status with the last iteration. If status has changed update the peripherals.
        bool currentOutputsStatus = m_psocHandlers[psocIndex].arePsocOutputsDisabled();

//        if (currentOutputsStatus != m_psocHandlers[psocIndex].lastOutputsStatus)
//        {
//            if (currentOutputsStatus)
//                int i = 0;
//            if (m_psocHandlers[psocIndex].pwmPeripheral != NULL)
//                m_psocHandlers[psocIndex].pwmPeripheral->setPsocOutputsEnabled(currentOutputsStatus);
//            if (m_psocHandlers[psocIndex].digitalOutPeripheral != NULL)
//                m_psocHandlers[psocIndex].digitalOutPeripheral->setPsocOutputsEnabled(currentOutputsStatus);
//            m_psocHandlers[psocIndex].lastOutputsStatus = currentOutputsStatus;
//        }
    }
}

void PsocManager::run()
{
    suspend();

    for (;;)
    {
        ITM_EVENT8(2, m_currentPsoc + 1);
        execute(m_currentPsoc);
        if (advanceToNextPsoc() && m_isSpiResetPending)
            resetSpiCommunication();
        // force a task switch in case a higher priority task is required.
//        yield();
        ITM_EVENT8(2, 0);
    }
}

bool PsocManager::hardwareInit()
{
    PSOC_setupSpiWithDma();

    if (Psc_BoardType == E_BoardType_Fec2)
    {
        m_psocHandlers[0].setPortAndPin(0, GPIOD, GPIO_Pin_2);
        m_psocHandlers[0].csHigh();
        m_psocHandlers[1].setPortAndPin(1, GPIOC, GPIO_Pin_6);
        m_psocHandlers[1].csHigh();
        m_psocHandlers[2].setPortAndPin(2, GPIOC, GPIO_Pin_7);
        m_psocHandlers[2].csHigh();
        m_psocHandlers[3].setPortAndPin(3, GPIOC, GPIO_Pin_8);
        m_psocHandlers[3].csHigh();
        m_psocHandlers[4].setPortAndPin(4, GPIOF, GPIO_Pin_0);
        m_psocHandlers[4].csHigh();
        m_psocHandlers[5].setPortAndPin(5, GPIOD, GPIO_Pin_15);
        m_psocHandlers[5].csHigh();
        m_psocHandlers[6].setPortAndPin(6, GPIOD, GPIO_Pin_6);
        m_psocHandlers[6].csHigh();
        m_psocHandlers[7].setPortAndPin(7, GPIOC, GPIO_Pin_9);
        m_psocHandlers[7].csHigh();
    }
    if (Psc_BoardType == E_BoardType_Fec3)
    {
        m_psocHandlers[0].setPortAndPin(0, GPIOD, GPIO_Pin_2);
        m_psocHandlers[0].csHigh();
        m_psocHandlers[1].setPortAndPin(1, GPIOC, GPIO_Pin_6);
        m_psocHandlers[1].csHigh();
        m_psocHandlers[2].setPortAndPin(2, GPIOC, GPIO_Pin_7);
        m_psocHandlers[2].csHigh();
        m_psocHandlers[3].setPortAndPin(3, GPIOC, GPIO_Pin_8);
        m_psocHandlers[3].csHigh();
        m_psocHandlers[4].setPortAndPin(4, GPIOE, GPIO_Pin_2);
        m_psocHandlers[4].csHigh();
        m_psocHandlers[5].setPortAndPin(5, GPIOD, GPIO_Pin_15);
        m_psocHandlers[5].csHigh();
        m_psocHandlers[6].setPortAndPin(6, GPIOD, GPIO_Pin_6);
        m_psocHandlers[6].csHigh();
        m_psocHandlers[7].setPortAndPin(7, GPIOC, GPIO_Pin_9);
        m_psocHandlers[7].csHigh();
        m_psocHandlers[8].setPortAndPin(8, GPIOD, GPIO_Pin_7);
        m_psocHandlers[8].csHigh();
        m_psocHandlers[9].setPortAndPin(9, GPIOB, GPIO_Pin_6);
        m_psocHandlers[9].csHigh();
    }

