maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocManager.cpp
    return true;
}

bool PsocManager::initTemperaturePeripheralByCableId(int cableId, int pssId, int sampleInterval, int lpfWindow,
        int numberOfDevices)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return false;

    return initTemperaturePeripheralByIndex(index, pssId, sampleInterval, lpfWindow, numberOfDevices);
}

bool PsocManager::initTemperaturePeripheralByIndex(int index, int pssId, int sampleInterval, int lpfWindow,
        int numberOfDevices)
{
    if (index == -1)
        return false;

    if (m_psocHandlers[index].getTemperaturePeripheral() != NULL)
    {
        if (pssId == 0)
        {
            return true;
        }
        else if (m_psocHandlers[index].getTemperaturePeripheral()->getPssId() == 0)
        {
            m_psocHandlers[index].getTemperaturePeripheral()->setPssId(pssId);
            return true;
        }
        else
            return false;
    }

    PsocTemperaturePeripheral* tempPeriph = new PsocTemperaturePeripheral();
    m_psocHandlers[index].setTemperaturePeripheral(tempPeriph);
    PeripheralRepository::getInstance().addPeripheral(tempPeriph);

    if (sampleInterval == 0)
        sampleInterval = 100;

    tempPeriph->setPssId(pssId);
    tempPeriph->setPsocHandler(&m_psocHandlers[index]);
    tempPeriph->setUpdateInterval(sampleInterval);
    tempPeriph->setLpfWindow(lpfWindow);

    // CHECK: Do we need to delete the just created peripheral?
    if (tempPeriph->getElementCount() < numberOfDevices)
        return false;

    return true;
}

bool PsocManager::initDigitalOutputPeripheralByCableId(int cableId, int pssId, int numberOfDevices)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return false;

    return initDigitalOutputPeripheralByIndex(index, pssId, numberOfDevices);
}

bool PsocManager::initDigitalOutputPeripheralByIndex(int index, int pssId, int numberOfDevices)
{
    if (index == -1)
        return false;

    if (m_psocHandlers[index].getDigitalOutPeripheral() != NULL)
    {
        if (pssId == 0)
        {
            return true;
        }
        else if (m_psocHandlers[index].getDigitalOutPeripheral()->getPssId() == 0)
        {
            m_psocHandlers[index].getDigitalOutPeripheral()->setPssId(pssId);
            return true;
        }
        else
            return false;
    }

    PsocDigitalOutputPeripheral* outPeriph = new PsocDigitalOutputPeripheral();
    m_psocHandlers[index].setDigitalOutPeripheral(outPeriph);
    PeripheralRepository::getInstance().addPeripheral(outPeriph);

    // we need to make sure that the PWM peripheral is instantiated, as it contains the channel type configuration
    // that should be downloaded to the PSoC when the configuration is done.
    if (initPwmPeripheralByIndex(index, 0, numberOfDevices) == false)
        return false;

    outPeriph->setPssId(pssId);
    outPeriph->setPsocHandler(&m_psocHandlers[index]);

    // CHECK: Do we need to delete the just created peripheral?
    if (outPeriph->getElementCount() < numberOfDevices)
        return false;

    return true;
}

bool PsocManager::initDigitalInputPeripheralByCableId(int cableId, int pssId, int numberOfDevices)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return false;

    return initDigitalInputPeripheralByIndex(index, pssId, numberOfDevices);
}

bool PsocManager::initDigitalInputPeripheralByIndex(int index, int pssId, int numberOfDevices)
{
    if (index == -1)
        return false;

    if (m_psocHandlers[index].getDigitalInPeripheral() != NULL)
    {
        if (pssId == 0)
        {
            return true;
        }
        else if (m_psocHandlers[index].getDigitalInPeripheral()->getPssId() == 0)
        {
            m_psocHandlers[index].getDigitalInPeripheral()->setPssId(pssId);
            return true;
        }
        else
            return false;
    }

    PsocDigitalInputPeripheral* inPeriph = new PsocDigitalInputPeripheral();
    m_psocHandlers[index].setDigitalInPeripheral(inPeriph);
    PeripheralRepository::getInstance().addPeripheral(inPeriph);

    inPeriph->setPssId(pssId);
    inPeriph->setPsocHandler(&m_psocHandlers[index]);

    // CHECK: Do we need to delete the just created peripheral?
    if (inPeriph->getElementCount() < numberOfDevices)
        return false;

    return true;
}

bool PsocManager::initAnalogInputPeripheralByCableId(int cableId, int pssId, int sampleInterval, int lpfWindow,
        int numberOfDevices)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return false;

    return initAnalogInputPeripheralByIndex(index, pssId, sampleInterval, lpfWindow, numberOfDevices);
}

bool PsocManager::initAnalogInputPeripheralByIndex(int index, int pssId, int sampleInterval, int lpfWindow,
        int numberOfDevices)
{
    if (index == -1)
        return false;

    if (m_psocHandlers[index].getAnalogInPeripheral() != NULL)
    {
        if (pssId == 0)
        {
            return true;
        }
        else if (m_psocHandlers[index].getAnalogInPeripheral()->getPssId() == 0)
        {
            m_psocHandlers[index].getAnalogInPeripheral()->setPssId(pssId);
            return true;
        }
        else
            return false;
    }

    PsocAnalogInputsPeripheral* inPeriph = new PsocAnalogInputsPeripheral();
    m_psocHandlers[index].setAnalogInPeripheral(inPeriph);
    PeripheralRepository::getInstance().addPeripheral(inPeriph);

    inPeriph->setPssId(pssId);
    inPeriph->setPsocHandler(&m_psocHandlers[index]);
    inPeriph->setUpdateInterval(sampleInterval);

    // CHECK: Do we need to delete the just created peripheral?
    if (inPeriph->getElementCount() < numberOfDevices)
        return false;

    return true;
}

bool PsocManager::initPwmPeripheralByCableId(int cableId, int pssId, int numberOfDevices)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return false;

    return initPwmPeripheralByIndex(index, pssId, numberOfDevices);
}

bool PsocManager::initPwmPeripheralByIndex(int index, int pssId, int numberOfDevices)
{
    if (index == -1)
        return false;

    if (m_psocHandlers[index].getPwmPeripheral() != NULL)
    {
        if (pssId == 0)
        {
            return true;
        }
        else if (m_psocHandlers[index].getPwmPeripheral()->getPssId() == 0)
        {
            m_psocHandlers[index].getPwmPeripheral()->setPssId(pssId);
            return true;
        }
        else
            return false;
    }

    PsocPwmOutputPeripheral* pwmPeriph = new PsocPwmOutputPeripheral();
    m_psocHandlers[index].setPwmPeripheral(pwmPeriph);
    PeripheralRepository::getInstance().addPeripheral(pwmPeriph);

    pwmPeriph->setPssId(pssId);
    pwmPeriph->setPsocHandler(&m_psocHandlers[index]);

    // CHECK: Do we need to delete the just created peripheral?
    if (pwmPeriph->getElementCount() < numberOfDevices)
        return false;

