maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocManager.cpp
    return true;
}

bool PsocManager::initAnalogOutputPeripheralByCableId(int cableId, int pssId, int numberOfDevices)
{
    int index = getPsocIndexByCableId(cableId);
    if (index == -1)
        return false;

    return initAnalogOutputPeripheralByIndex(index, pssId, numberOfDevices);
}

bool PsocManager::initAnalogOutputPeripheralByIndex(int index, int pssId, int numberOfDevices)
{
    if (index == -1)
        return false;

    if (m_psocHandlers[index].getAnalogOutPeripheral() != NULL)
    {
        if (pssId == 0)
        {
            return true;
        }
        else if (m_psocHandlers[index].getAnalogOutPeripheral()->getPssId() == 0)
        {
            m_psocHandlers[index].getAnalogOutPeripheral()->setPssId(pssId);
            return true;
        }
        else
            return false;
    }

    PsocAnalogOutputPeripheral* analogOutPeriph = new PsocAnalogOutputPeripheral();
    m_psocHandlers[index].setAnalogOutPeripheral(analogOutPeriph);
    PeripheralRepository::getInstance().addPeripheral(analogOutPeriph);

    analogOutPeriph->setPssId(pssId);
    analogOutPeriph->setPsocHandler(&m_psocHandlers[index]);

    // CHECK: Do we need to delete the just created peripheral?
    if (analogOutPeriph->getElementCount() < numberOfDevices)
        return false;

    return true;
}

bool PsocManager::enablePsoc(int index)
{
    resume();
    m_isInBootloader = false;
    //++m_numOfActivePsocs;
    bool result;
    E_PsocSpiError spiError;
    T_PsocVersion psocVersion;
    uint8_t cable1, cable2, cable3, errors;
    if (m_psocHandlers[index].getPsocCommState() != E_PsocCommState_Enabled)
    {
        result = false;
        int numOfRetries = 0;
        do
        {
            // the psoc must enabled to try to communicate with it.
            // If communication fails we disable it again.
            m_psocHandlers[index].setPsocCommState(E_PsocCommState_Enabled);

            // first we need to check that the protocol versions match:
            do
            {
                spiError = getPsocVersion(index, psocVersion);
                if (spiError == E_PsocSpiError_Ok)
                {
                    if (psocVersion.firmwareVersion.full != 0 && psocVersion.protocolVersion.full != 0)
                        result = true;
                }
            } while (++numOfRetries < M_NUMBER_OF_RETRIES && result == false);

            if (result)
            {
                T_VersionUnion expectedIcdVersion;
                expectedIcdVersion.split.major = M_PSOC_ICD_VERSION_MAJOR;
                expectedIcdVersion.split.minor = M_PSOC_ICD_VERSION_MINOR;
                expectedIcdVersion.split.build = M_PSOC_ICD_VERSION_BUILD;
                expectedIcdVersion.split.revision = M_PSOC_ICD_VERSION_REVISION;

                if (psocVersion.protocolVersion.full != expectedIcdVersion.full || psocVersion.boardType != Psc_GetBoardType())
                    result = false;
                else
                {
                    result = false;
                    do
                    {
                        spiError = getPsocCableID(index, cable1, cable2, cable3, errors);
                        if (spiError == E_PsocSpiError_Ok/* && errors == 0*/)
                        {
//                            m_psocHandlers[index].resetPsocOutputs();
                            result = true;
                        }
//                        {
//                            // first we need
//                            if (cable1 == cable2 && cable1 == cable3)
//                            {
//                                m_psocHandlers[index].cableId = cable1;
//                                if (cable1 == 0)
//                                    m_psocHandlers[index].setPsocState(E_PsocCommState_Disabled);
//                                else
//                                    m_psocHandlers[index].setPsocState(E_PsocCommState_Enabled);
//                                result = true;
//                            }
//                        }
                    } while (++numOfRetries < M_NUMBER_OF_RETRIES && result == false);
                }
            }
        } while (++numOfRetries < M_NUMBER_OF_RETRIES && result == false);
    }
    if (result == false)
    {
        m_psocHandlers[index].setPsocCommState(E_PsocCommState_Error);
        --m_numOfActivePsocs;
    }
    if (m_numOfActivePsocs == 0)
    {
        suspend();
    }
    return result;
}

void PsocManager::initAllPsocs()
{
    int i;
//    suspend();

    delay(1000);

    m_totalNumberOfPsocs = Psc_GetNumberOfSlaves();
    m_numOfActivePsocs = m_totalNumberOfPsocs;
    PSOC_setupSpiWithDma();
    hardwareInit();

//    if (Psc_BoardType == E_BoardType_Fec3)
//    {
//        FEC3_PSOC_RESET_HIGH();
//        delay(500);
//        FEC3_PSOC_RESET_LOW();
//        delay(1000);
//    }

//    for (i = 0; i < m_totalNumberOfPsocs; ++i)
//    {
//        execute(i);
////        delay(10);
////        execute(i);
//    }
//
//    delay(2500);

//    resume();

    for (i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        enablePsoc(i);
    }
}

void PsocManager::enableDebugCableIdMode()
{
    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        m_psocHandlers[i].enableDebugCableIdMode();
        m_psocHandlers[i].setCableID(i + 1);
    }
}

/**
 * Return TRUE if finished the round-robin trip.
 */
bool PsocManager::advanceToNextPsoc()
{
    int previousPsoc = m_currentPsoc;
    do
    {
        m_currentPsoc = (m_currentPsoc + 1);
        if (m_currentPsoc >= m_totalNumberOfPsocs)
            m_currentPsoc -= m_totalNumberOfPsocs;
    } while (m_numOfActivePsocs != 0 && m_psocHandlers[m_currentPsoc].getPsocCommState() == E_PsocCommState_Error);
    // if the new index is the same as the previous index,
    // add a delay to let the PSoC handle the request.
    if (previousPsoc >= m_currentPsoc)
    {
        delay(m_roundRobinDelay);
        return true;
    }
    else
        return false;
//    if (m_numOfActivePsocs == 0)
//        suspend();
}

