maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocManager.cpp
void PsocManager::reset()
{
//    m_numOfActivePsocs = 0;
//    suspend();

//    delay(2500);

    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        // reset all outputs on the psoc.
        resetPsocOutputs(&m_psocHandlers[i]);
    }

    // wait for pending outputs to be reset
    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        while (m_psocHandlers[i].isPendingUpdate())
            delay(10);
    }

    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        // reset the psoc handler:
        m_psocHandlers[i].resetPeripherals();
    }

//    PSOC_setupSpiWithDma();

//    initAllPsocs();
}

bool PsocManager::setPsocAllowedCableId(int index, uint64_t allowedMask)
{
    if (index >= m_totalNumberOfPsocs)
        return false;

    /*
     // if the psoc isn't enabled yet we need to enable it.
     if (m_psocHandlers[index].getPsocState() == E_PsocCommState_Disabled)
     // calling the get by index will also enable the PSoC.
     getPsocHandlerByIndex(index);
     */

    // check the state - if the psoc is not enabled it means that we can't communicate with it for some reason.
    // however this doesn't mean that we have an error, as we can assign an allowed mask for
    // all psocs, but use only some of them.
    if (m_psocHandlers[index].getPsocCommState() != E_PsocCommState_Enabled)
        return true;

    uint64_t actualCableMask = (1 << (m_psocHandlers[index].getCableID() - 1));

    // check the mask - if no bits are set it means the cable is not allowed for this PSoC.
    if ((allowedMask & actualCableMask == 0) && (actualCableMask != 0))
        return false;

    return true;
}

void PsocManager::downloadConfigurationToPsocs()
{
    // TODO: Check if this function can be called from the same psoc manager task.
    takeBlockingSemaphore();
    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        // try to set the state to "Enabled". If there are peripherals defined the state would remain "Enabled".
        m_psocHandlers[i].setPsocCommState(E_PsocCommState_Enabled);
        if (m_psocHandlers[i].getPsocCommState() == E_PsocCommState_Enabled)
        {
            m_psocHandlers[i].startErrorRecovery(&m_blockingCallCompleteSemaphore);
            m_psocHandlers[i].startBoardConfig(&m_blockingCallCompleteSemaphore);
            if (m_psocHandlers[i].getTemperaturePeripheral() != NULL)
                m_psocHandlers[i].getTemperaturePeripheral()->downloadConfigurationToPsoc(
                        &m_blockingCallCompleteSemaphore);
            if (m_psocHandlers[i].getPwmPeripheral() != NULL)
                m_psocHandlers[i].getPwmPeripheral()->downloadConfigurationToPsoc(&m_blockingCallCompleteSemaphore);
            if (m_psocHandlers[i].getAnalogInPeripheral() != NULL)
                m_psocHandlers[i].getAnalogInPeripheral()->downloadConfigurationToPsoc(
                        &m_blockingCallCompleteSemaphore);
            m_psocHandlers[i].configChannelFunction(&m_blockingCallCompleteSemaphore,
                    m_psocHandlers[i].getPsocPrimaryFunction());
            m_psocHandlers[i].endBoardConfig(&m_blockingCallCompleteSemaphore);
            // TODO: In HW Valication mode, check if the Digital IO configuraiton hard-coded in the PSoC can be eliminated.
            // until then, we need to reconfigure the digital IOs:
            if (m_psocHandlers[i].getPsocPrimaryFunction() == E_PsocPrimaryFunction_HwValidation)
            {
                if (m_psocHandlers[i].getPwmPeripheral() != NULL)
                    m_psocHandlers[i].getPwmPeripheral()->downloadConfigurationToPsoc(&m_blockingCallCompleteSemaphore);
            }
        }

    }
    giveBlockingSemaphore();
}

bool PsocManager::setPsocChannelFunction(int cableId, E_PsocPrimaryFunction function)
{
//    m_psocHandlers[channelIndex].psocPrimaryFunction = function;
    PsocHandler* psocHandler;

    psocHandler = getPsocHandlerByCableId(cableId);

    if (psocHandler == NULL)
        return false;

    psocHandler->setPsocPrimaryFunction(function);

    return true;
}

E_PsocSpiError PsocManager::startPsocBootloader(uint8_t psocIndex)
{
    PsocHandler* psocHandler;
    E_PsocSpiError spiResult;

    if (!m_isInBootloader)
        return E_PsocSpiError_InvalidState;

    psocHandler = &m_psocHandlers[psocIndex];

    if (psocHandler == NULL)
        return E_PsocSpiError_NoSlaveResponse;

    psocHandler->csLow();

    spiResult = psocHandler->startPsocBootloader();

    psocHandler->csHigh();

    return spiResult;
}

E_PsocSpiError PsocManager::endPsocBootloader(uint8_t psocIndex)
{
    PsocHandler* psocHandler;
    psocHandler = &m_psocHandlers[psocIndex];

    if (psocHandler == NULL)
        return E_PsocSpiError_NoSlaveResponse;

    psocHandler->csHigh();

    return E_PsocSpiError_Ok;
}

E_PsocSpiError PsocManager::startBootloader()
{
    suspend();

    delay(2000);

    m_isInBootloader = true;

    return E_PsocSpiError_Ok;
}

void PsocManager::resetPsocOutputs(PsocHandler* psocHandler)
{
    if (psocHandler->getPsocCommState() != E_PsocCommState_Enabled)
        return;

    // reset all outputs on the PSoC:
    psocHandler->resetOutputs();

    // wait until all outputs have been written:
//    while (psocHandler->isPendingUpdate())
//    {
//        vTaskDelay(10);
//    }
}

void PsocManager::startRecovery()
{
    //resetSpiCommunication();
    //downloadConfigurationToPsocs();
    // TODO: Check if this function can be called from the same psoc manager task.
    takeBlockingSemaphore();
    for (int i = 0; i < m_totalNumberOfPsocs; ++i)
    {
        if (m_psocHandlers[i].getPsocCommState() == E_PsocCommState_Enabled)
        {
            m_psocHandlers[i].startErrorRecovery(&m_blockingCallCompleteSemaphore);
        }
    }
    giveBlockingSemaphore();
}
